Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/pio/pic32cz8110ca90208.h
#define PIN_PD17E_EBI_D7                           _UINT32_(113)
#define MUX_PD17E_EBI_D7                           _UINT32_(4) 
#define PINMUX_PD17E_EBI_D7                        ((PIN_PD17E_EBI_D7 << 16) | MUX_PD17E_EBI_D7)
#define PORT_PD17E_EBI_D7                          (_UINT32_(1) << 17)

#define PIN_PD04E_EBI_D8                           _UINT32_(100)
#define MUX_PD04E_EBI_D8                           _UINT32_(4) 
#define PINMUX_PD04E_EBI_D8                        ((PIN_PD04E_EBI_D8 << 16) | MUX_PD04E_EBI_D8)
#define PORT_PD04E_EBI_D8                          (_UINT32_(1) << 4)

#define PIN_PD18E_EBI_D9                           _UINT32_(114)
#define MUX_PD18E_EBI_D9                           _UINT32_(4) 
#define PINMUX_PD18E_EBI_D9                        ((PIN_PD18E_EBI_D9 << 16) | MUX_PD18E_EBI_D9)
#define PORT_PD18E_EBI_D9                          (_UINT32_(1) << 18)

#define PIN_PD19E_EBI_D10                          _UINT32_(115)
#define MUX_PD19E_EBI_D10                          _UINT32_(4) 
#define PINMUX_PD19E_EBI_D10                       ((PIN_PD19E_EBI_D10 << 16) | MUX_PD19E_EBI_D10)
#define PORT_PD19E_EBI_D10                         (_UINT32_(1) << 19)

#define PIN_PD05E_EBI_D11                          _UINT32_(101)
#define MUX_PD05E_EBI_D11                          _UINT32_(4) 
#define PINMUX_PD05E_EBI_D11                       ((PIN_PD05E_EBI_D11 << 16) | MUX_PD05E_EBI_D11)
#define PORT_PD05E_EBI_D11                         (_UINT32_(1) << 5)

#define PIN_PD06E_EBI_D12                          _UINT32_(102)
#define MUX_PD06E_EBI_D12                          _UINT32_(4) 
#define PINMUX_PD06E_EBI_D12                       ((PIN_PD06E_EBI_D12 << 16) | MUX_PD06E_EBI_D12)
#define PORT_PD06E_EBI_D12                         (_UINT32_(1) << 6)

#define PIN_PD20E_EBI_D13                          _UINT32_(116)
#define MUX_PD20E_EBI_D13                          _UINT32_(4) 
#define PINMUX_PD20E_EBI_D13                       ((PIN_PD20E_EBI_D13 << 16) | MUX_PD20E_EBI_D13)
#define PORT_PD20E_EBI_D13                         (_UINT32_(1) << 20)

#define PIN_PD21E_EBI_D14                          _UINT32_(117)
#define MUX_PD21E_EBI_D14                          _UINT32_(4) 
#define PINMUX_PD21E_EBI_D14                       ((PIN_PD21E_EBI_D14 << 16) | MUX_PD21E_EBI_D14)
#define PORT_PD21E_EBI_D14                         (_UINT32_(1) << 21)

#define PIN_PD07E_EBI_D15                          _UINT32_(103)
#define MUX_PD07E_EBI_D15                          _UINT32_(4) 
#define PINMUX_PD07E_EBI_D15                       ((PIN_PD07E_EBI_D15 << 16) | MUX_PD07E_EBI_D15)
#define PORT_PD07E_EBI_D15                         (_UINT32_(1) << 7)

#define PIN_PC23E_EBI_NBS0_A0                      _UINT32_(87)
#define MUX_PC23E_EBI_NBS0_A0                      _UINT32_(4) 
#define PINMUX_PC23E_EBI_NBS0_A0                   ((PIN_PC23E_EBI_NBS0_A0 << 16) | MUX_PC23E_EBI_NBS0_A0)
#define PORT_PC23E_EBI_NBS0_A0                     (_UINT32_(1) << 23)

#define PIN_PC06E_EBI_NBS1_NWR1                    _UINT32_(70)
#define MUX_PC06E_EBI_NBS1_NWR1                    _UINT32_(4) 
#define PINMUX_PC06E_EBI_NBS1_NWR1                 ((PIN_PC06E_EBI_NBS1_NWR1 << 16) | MUX_PC06E_EBI_NBS1_NWR1)
#define PORT_PC06E_EBI_NBS1_NWR1                   (_UINT32_(1) << 6)

#define PIN_PC08E_EBI_NCS0                         _UINT32_(72)
#define MUX_PC08E_EBI_NCS0                         _UINT32_(4) 
#define PINMUX_PC08E_EBI_NCS0                      ((PIN_PC08E_EBI_NCS0 << 16) | MUX_PC08E_EBI_NCS0)
#define PORT_PC08E_EBI_NCS0                        (_UINT32_(1) << 8)

#define PIN_PC07E_EBI_NCS1                         _UINT32_(71)
#define MUX_PC07E_EBI_NCS1                         _UINT32_(4) 
#define PINMUX_PC07E_EBI_NCS1                      ((PIN_PC07E_EBI_NCS1 << 16) | MUX_PC07E_EBI_NCS1)
#define PORT_PC07E_EBI_NCS1                        (_UINT32_(1) << 7)

#define PIN_PC22E_EBI_NCS2                         _UINT32_(86)
#define MUX_PC22E_EBI_NCS2                         _UINT32_(4) 
#define PINMUX_PC22E_EBI_NCS2                      ((PIN_PC22E_EBI_NCS2 << 16) | MUX_PC22E_EBI_NCS2)
#define PORT_PC22E_EBI_NCS2                        (_UINT32_(1) << 22)

#define PIN_PC21E_EBI_NCS3                         _UINT32_(85)
#define MUX_PC21E_EBI_NCS3                         _UINT32_(4) 
#define PINMUX_PC21E_EBI_NCS3                      ((PIN_PC21E_EBI_NCS3 << 16) | MUX_PC21E_EBI_NCS3)
#define PORT_PC21E_EBI_NCS3                        (_UINT32_(1) << 21)

#define PIN_PC05E_EBI_NRD                          _UINT32_(69)
#define MUX_PC05E_EBI_NRD                          _UINT32_(4) 
#define PINMUX_PC05E_EBI_NRD                       ((PIN_PC05E_EBI_NRD << 16) | MUX_PC05E_EBI_NRD)
#define PORT_PC05E_EBI_NRD                         (_UINT32_(1) << 5)

#define PIN_PD08E_EBI_NWAIT                        _UINT32_(104)
#define MUX_PD08E_EBI_NWAIT                        _UINT32_(4) 
#define PINMUX_PD08E_EBI_NWAIT                     ((PIN_PD08E_EBI_NWAIT << 16) | MUX_PD08E_EBI_NWAIT)
#define PORT_PD08E_EBI_NWAIT                       (_UINT32_(1) << 8)

#define PIN_PC04E_EBI_NWE_NWR0                     _UINT32_(68)
#define MUX_PC04E_EBI_NWE_NWR0                     _UINT32_(4) 
#define PINMUX_PC04E_EBI_NWE_NWR0                  ((PIN_PC04E_EBI_NWE_NWR0 << 16) | MUX_PC04E_EBI_NWE_NWR0)
#define PORT_PC04E_EBI_NWE_NWR0                    (_UINT32_(1) << 4)

#define PIN_PG04E_EBI_NWE_NWR0                     _UINT32_(196)
#define MUX_PG04E_EBI_NWE_NWR0                     _UINT32_(4) 
#define PINMUX_PG04E_EBI_NWE_NWR0                  ((PIN_PG04E_EBI_NWE_NWR0 << 16) | MUX_PG04E_EBI_NWE_NWR0)
#define PORT_PG04E_EBI_NWE_NWR0                    (_UINT32_(1) << 4)

/* ========== PORT definition for EIC peripheral ========== */
#define PIN_PA00A_EIC_EXTINT0                      _UINT32_(0) 
#define MUX_PA00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PA00A_EIC_EXTINT0                   ((PIN_PA00A_EIC_EXTINT0 << 16) | MUX_PA00A_EIC_EXTINT0)
#define PORT_PA00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PA00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PA00 External Interrupt Line */

