Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/pio/pic32cz8110ca90208.h
#define PIN_PA16A_EIC_EXTINT0                      _UINT32_(16)
#define MUX_PA16A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PA16A_EIC_EXTINT0                   ((PIN_PA16A_EIC_EXTINT0 << 16) | MUX_PA16A_EIC_EXTINT0)
#define PORT_PA16A_EIC_EXTINT0                     (_UINT32_(1) << 16)
#define PIN_PA16A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PA16 External Interrupt Line */

#define PIN_PB00A_EIC_EXTINT0                      _UINT32_(32)
#define MUX_PB00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PB00A_EIC_EXTINT0                   ((PIN_PB00A_EIC_EXTINT0 << 16) | MUX_PB00A_EIC_EXTINT0)
#define PORT_PB00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PB00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PB00 External Interrupt Line */

#define PIN_PB16A_EIC_EXTINT0                      _UINT32_(48)
#define MUX_PB16A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PB16A_EIC_EXTINT0                   ((PIN_PB16A_EIC_EXTINT0 << 16) | MUX_PB16A_EIC_EXTINT0)
#define PORT_PB16A_EIC_EXTINT0                     (_UINT32_(1) << 16)
#define PIN_PB16A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PB16 External Interrupt Line */

#define PIN_PC00A_EIC_EXTINT0                      _UINT32_(64)
#define MUX_PC00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PC00A_EIC_EXTINT0                   ((PIN_PC00A_EIC_EXTINT0 << 16) | MUX_PC00A_EIC_EXTINT0)
#define PORT_PC00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PC00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PC00 External Interrupt Line */

#define PIN_PD00A_EIC_EXTINT0                      _UINT32_(96)
#define MUX_PD00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PD00A_EIC_EXTINT0                   ((PIN_PD00A_EIC_EXTINT0 << 16) | MUX_PD00A_EIC_EXTINT0)
#define PORT_PD00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PD00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PD00 External Interrupt Line */

#define PIN_PD15A_EIC_EXTINT0                      _UINT32_(111)
#define MUX_PD15A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PD15A_EIC_EXTINT0                   ((PIN_PD15A_EIC_EXTINT0 << 16) | MUX_PD15A_EIC_EXTINT0)
#define PORT_PD15A_EIC_EXTINT0                     (_UINT32_(1) << 15)
#define PIN_PD15A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PD15 External Interrupt Line */

#define PIN_PE00A_EIC_EXTINT0                      _UINT32_(128)
#define MUX_PE00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PE00A_EIC_EXTINT0                   ((PIN_PE00A_EIC_EXTINT0 << 16) | MUX_PE00A_EIC_EXTINT0)
#define PORT_PE00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PE00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PE00 External Interrupt Line */

#define PIN_PG00A_EIC_EXTINT0                      _UINT32_(192)
#define MUX_PG00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PG00A_EIC_EXTINT0                   ((PIN_PG00A_EIC_EXTINT0 << 16) | MUX_PG00A_EIC_EXTINT0)
#define PORT_PG00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PG00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PG00 External Interrupt Line */

#define PIN_PA01A_EIC_EXTINT1                      _UINT32_(1) 
#define MUX_PA01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PA01A_EIC_EXTINT1                   ((PIN_PA01A_EIC_EXTINT1 << 16) | MUX_PA01A_EIC_EXTINT1)
#define PORT_PA01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PA01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PA01 External Interrupt Line */

#define PIN_PA17A_EIC_EXTINT1                      _UINT32_(17)
#define MUX_PA17A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PA17A_EIC_EXTINT1                   ((PIN_PA17A_EIC_EXTINT1 << 16) | MUX_PA17A_EIC_EXTINT1)
#define PORT_PA17A_EIC_EXTINT1                     (_UINT32_(1) << 17)
#define PIN_PA17A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PA17 External Interrupt Line */

#define PIN_PB01A_EIC_EXTINT1                      _UINT32_(33)
#define MUX_PB01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PB01A_EIC_EXTINT1                   ((PIN_PB01A_EIC_EXTINT1 << 16) | MUX_PB01A_EIC_EXTINT1)
#define PORT_PB01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PB01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PB01 External Interrupt Line */

#define PIN_PB17A_EIC_EXTINT1                      _UINT32_(49)
#define MUX_PB17A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PB17A_EIC_EXTINT1                   ((PIN_PB17A_EIC_EXTINT1 << 16) | MUX_PB17A_EIC_EXTINT1)
#define PORT_PB17A_EIC_EXTINT1                     (_UINT32_(1) << 17)
#define PIN_PB17A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PB17 External Interrupt Line */

#define PIN_PC01A_EIC_EXTINT1                      _UINT32_(65)
#define MUX_PC01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PC01A_EIC_EXTINT1                   ((PIN_PC01A_EIC_EXTINT1 << 16) | MUX_PC01A_EIC_EXTINT1)
#define PORT_PC01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PC01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PC01 External Interrupt Line */

#define PIN_PC02A_EIC_EXTINT1                      _UINT32_(66)
#define MUX_PC02A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PC02A_EIC_EXTINT1                   ((PIN_PC02A_EIC_EXTINT1 << 16) | MUX_PC02A_EIC_EXTINT1)
#define PORT_PC02A_EIC_EXTINT1                     (_UINT32_(1) << 2)
#define PIN_PC02A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PC02 External Interrupt Line */

#define PIN_PD01A_EIC_EXTINT1                      _UINT32_(97)
#define MUX_PD01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PD01A_EIC_EXTINT1                   ((PIN_PD01A_EIC_EXTINT1 << 16) | MUX_PD01A_EIC_EXTINT1)
#define PORT_PD01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PD01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PD01 External Interrupt Line */

#define PIN_PD16A_EIC_EXTINT1                      _UINT32_(112)
#define MUX_PD16A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PD16A_EIC_EXTINT1                   ((PIN_PD16A_EIC_EXTINT1 << 16) | MUX_PD16A_EIC_EXTINT1)
#define PORT_PD16A_EIC_EXTINT1                     (_UINT32_(1) << 16)
#define PIN_PD16A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PD16 External Interrupt Line */

#define PIN_PE01A_EIC_EXTINT1                      _UINT32_(129)
#define MUX_PE01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PE01A_EIC_EXTINT1                   ((PIN_PE01A_EIC_EXTINT1 << 16) | MUX_PE01A_EIC_EXTINT1)
#define PORT_PE01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PE01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PE01 External Interrupt Line */

#define PIN_PF00A_EIC_EXTINT1                      _UINT32_(160)
#define MUX_PF00A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PF00A_EIC_EXTINT1                   ((PIN_PF00A_EIC_EXTINT1 << 16) | MUX_PF00A_EIC_EXTINT1)
#define PORT_PF00A_EIC_EXTINT1                     (_UINT32_(1) << 0)
#define PIN_PF00A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PF00 External Interrupt Line */

#define PIN_PF01A_EIC_EXTINT1                      _UINT32_(161)
#define MUX_PF01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PF01A_EIC_EXTINT1                   ((PIN_PF01A_EIC_EXTINT1 << 16) | MUX_PF01A_EIC_EXTINT1)
#define PORT_PF01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PF01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PF01 External Interrupt Line */

#define PIN_PG01A_EIC_EXTINT1                      _UINT32_(193)
#define MUX_PG01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PG01A_EIC_EXTINT1                   ((PIN_PG01A_EIC_EXTINT1 << 16) | MUX_PG01A_EIC_EXTINT1)
#define PORT_PG01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PG01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PG01 External Interrupt Line */

