Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/pio/pic32cz8110ca90208.h
#define PIN_PC10D_SERCOM2_PAD2                     _UINT32_(74)
#define MUX_PC10D_SERCOM2_PAD2                     _UINT32_(3) 
#define PINMUX_PC10D_SERCOM2_PAD2                  ((PIN_PC10D_SERCOM2_PAD2 << 16) | MUX_PC10D_SERCOM2_PAD2)
#define PORT_PC10D_SERCOM2_PAD2                    (_UINT32_(1) << 10)

#define PIN_PA04D_SERCOM2_PAD2                     _UINT32_(4) 
#define MUX_PA04D_SERCOM2_PAD2                     _UINT32_(3) 
#define PINMUX_PA04D_SERCOM2_PAD2                  ((PIN_PA04D_SERCOM2_PAD2 << 16) | MUX_PA04D_SERCOM2_PAD2)
#define PORT_PA04D_SERCOM2_PAD2                    (_UINT32_(1) << 4)

#define PIN_PC11D_SERCOM2_PAD3                     _UINT32_(75)
#define MUX_PC11D_SERCOM2_PAD3                     _UINT32_(3) 
#define PINMUX_PC11D_SERCOM2_PAD3                  ((PIN_PC11D_SERCOM2_PAD3 << 16) | MUX_PC11D_SERCOM2_PAD3)
#define PORT_PC11D_SERCOM2_PAD3                    (_UINT32_(1) << 11)

#define PIN_PA03D_SERCOM2_PAD3                     _UINT32_(3) 
#define MUX_PA03D_SERCOM2_PAD3                     _UINT32_(3) 
#define PINMUX_PA03D_SERCOM2_PAD3                  ((PIN_PA03D_SERCOM2_PAD3 << 16) | MUX_PA03D_SERCOM2_PAD3)
#define PORT_PA03D_SERCOM2_PAD3                    (_UINT32_(1) << 3)

/* ========== PORT definition for SERCOM3 peripheral ========== */
#define PIN_PC12D_SERCOM3_PAD0                     _UINT32_(76)
#define MUX_PC12D_SERCOM3_PAD0                     _UINT32_(3) 
#define PINMUX_PC12D_SERCOM3_PAD0                  ((PIN_PC12D_SERCOM3_PAD0 << 16) | MUX_PC12D_SERCOM3_PAD0)
#define PORT_PC12D_SERCOM3_PAD0                    (_UINT32_(1) << 12)

#define PIN_PD03D_SERCOM3_PAD0                     _UINT32_(99)
#define MUX_PD03D_SERCOM3_PAD0                     _UINT32_(3) 
#define PINMUX_PD03D_SERCOM3_PAD0                  ((PIN_PD03D_SERCOM3_PAD0 << 16) | MUX_PD03D_SERCOM3_PAD0)
#define PORT_PD03D_SERCOM3_PAD0                    (_UINT32_(1) << 3)

#define PIN_PC13D_SERCOM3_PAD1                     _UINT32_(77)
#define MUX_PC13D_SERCOM3_PAD1                     _UINT32_(3) 
#define PINMUX_PC13D_SERCOM3_PAD1                  ((PIN_PC13D_SERCOM3_PAD1 << 16) | MUX_PC13D_SERCOM3_PAD1)
#define PORT_PC13D_SERCOM3_PAD1                    (_UINT32_(1) << 13)

#define PIN_PD04D_SERCOM3_PAD1                     _UINT32_(100)
#define MUX_PD04D_SERCOM3_PAD1                     _UINT32_(3) 
#define PINMUX_PD04D_SERCOM3_PAD1                  ((PIN_PD04D_SERCOM3_PAD1 << 16) | MUX_PD04D_SERCOM3_PAD1)
#define PORT_PD04D_SERCOM3_PAD1                    (_UINT32_(1) << 4)

#define PIN_PC14D_SERCOM3_PAD2                     _UINT32_(78)
#define MUX_PC14D_SERCOM3_PAD2                     _UINT32_(3) 
#define PINMUX_PC14D_SERCOM3_PAD2                  ((PIN_PC14D_SERCOM3_PAD2 << 16) | MUX_PC14D_SERCOM3_PAD2)
#define PORT_PC14D_SERCOM3_PAD2                    (_UINT32_(1) << 14)

#define PIN_PD05D_SERCOM3_PAD2                     _UINT32_(101)
#define MUX_PD05D_SERCOM3_PAD2                     _UINT32_(3) 
#define PINMUX_PD05D_SERCOM3_PAD2                  ((PIN_PD05D_SERCOM3_PAD2 << 16) | MUX_PD05D_SERCOM3_PAD2)
#define PORT_PD05D_SERCOM3_PAD2                    (_UINT32_(1) << 5)

#define PIN_PC15D_SERCOM3_PAD3                     _UINT32_(79)
#define MUX_PC15D_SERCOM3_PAD3                     _UINT32_(3) 
#define PINMUX_PC15D_SERCOM3_PAD3                  ((PIN_PC15D_SERCOM3_PAD3 << 16) | MUX_PC15D_SERCOM3_PAD3)
#define PORT_PC15D_SERCOM3_PAD3                    (_UINT32_(1) << 15)

#define PIN_PD06D_SERCOM3_PAD3                     _UINT32_(102)
#define MUX_PD06D_SERCOM3_PAD3                     _UINT32_(3) 
#define PINMUX_PD06D_SERCOM3_PAD3                  ((PIN_PD06D_SERCOM3_PAD3 << 16) | MUX_PD06D_SERCOM3_PAD3)
#define PORT_PD06D_SERCOM3_PAD3                    (_UINT32_(1) << 6)

/* ========== PORT definition for SERCOM4 peripheral ========== */
#define PIN_PC21D_SERCOM4_PAD0                     _UINT32_(85)
#define MUX_PC21D_SERCOM4_PAD0                     _UINT32_(3) 
#define PINMUX_PC21D_SERCOM4_PAD0                  ((PIN_PC21D_SERCOM4_PAD0 << 16) | MUX_PC21D_SERCOM4_PAD0)
#define PORT_PC21D_SERCOM4_PAD0                    (_UINT32_(1) << 21)

#define PIN_PC22D_SERCOM4_PAD1                     _UINT32_(86)
#define MUX_PC22D_SERCOM4_PAD1                     _UINT32_(3) 
#define PINMUX_PC22D_SERCOM4_PAD1                  ((PIN_PC22D_SERCOM4_PAD1 << 16) | MUX_PC22D_SERCOM4_PAD1)
#define PORT_PC22D_SERCOM4_PAD1                    (_UINT32_(1) << 22)

#define PIN_PC23D_SERCOM4_PAD2                     _UINT32_(87)
#define MUX_PC23D_SERCOM4_PAD2                     _UINT32_(3) 
#define PINMUX_PC23D_SERCOM4_PAD2                  ((PIN_PC23D_SERCOM4_PAD2 << 16) | MUX_PC23D_SERCOM4_PAD2)
#define PORT_PC23D_SERCOM4_PAD2                    (_UINT32_(1) << 23)

#define PIN_PC24D_SERCOM4_PAD3                     _UINT32_(88)
#define MUX_PC24D_SERCOM4_PAD3                     _UINT32_(3) 
#define PINMUX_PC24D_SERCOM4_PAD3                  ((PIN_PC24D_SERCOM4_PAD3 << 16) | MUX_PC24D_SERCOM4_PAD3)
#define PORT_PC24D_SERCOM4_PAD3                    (_UINT32_(1) << 24)

/* ========== PORT definition for SERCOM5 peripheral ========== */
#define PIN_PC25D_SERCOM5_PAD0                     _UINT32_(89)
#define MUX_PC25D_SERCOM5_PAD0                     _UINT32_(3) 
#define PINMUX_PC25D_SERCOM5_PAD0                  ((PIN_PC25D_SERCOM5_PAD0 << 16) | MUX_PC25D_SERCOM5_PAD0)
#define PORT_PC25D_SERCOM5_PAD0                    (_UINT32_(1) << 25)

#define PIN_PC26D_SERCOM5_PAD1                     _UINT32_(90)
#define MUX_PC26D_SERCOM5_PAD1                     _UINT32_(3) 
#define PINMUX_PC26D_SERCOM5_PAD1                  ((PIN_PC26D_SERCOM5_PAD1 << 16) | MUX_PC26D_SERCOM5_PAD1)
#define PORT_PC26D_SERCOM5_PAD1                    (_UINT32_(1) << 26)

#define PIN_PC27D_SERCOM5_PAD2                     _UINT32_(91)
#define MUX_PC27D_SERCOM5_PAD2                     _UINT32_(3) 
#define PINMUX_PC27D_SERCOM5_PAD2                  ((PIN_PC27D_SERCOM5_PAD2 << 16) | MUX_PC27D_SERCOM5_PAD2)
#define PORT_PC27D_SERCOM5_PAD2                    (_UINT32_(1) << 27)

#define PIN_PC28D_SERCOM5_PAD3                     _UINT32_(92)
#define MUX_PC28D_SERCOM5_PAD3                     _UINT32_(3) 
#define PINMUX_PC28D_SERCOM5_PAD3                  ((PIN_PC28D_SERCOM5_PAD3 << 16) | MUX_PC28D_SERCOM5_PAD3)
#define PORT_PC28D_SERCOM5_PAD3                    (_UINT32_(1) << 28)

