Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/pio/pic32cz8110ca90208.h
#define PIN_PD28F_TCC2_WO2                         _UINT32_(124)
#define MUX_PD28F_TCC2_WO2                         _UINT32_(5) 
#define PINMUX_PD28F_TCC2_WO2                      ((PIN_PD28F_TCC2_WO2 << 16) | MUX_PD28F_TCC2_WO2)
#define PORT_PD28F_TCC2_WO2                        (_UINT32_(1) << 28)

#define PIN_PA04F_TCC2_WO3                         _UINT32_(4) 
#define MUX_PA04F_TCC2_WO3                         _UINT32_(5) 
#define PINMUX_PA04F_TCC2_WO3                      ((PIN_PA04F_TCC2_WO3 << 16) | MUX_PA04F_TCC2_WO3)
#define PORT_PA04F_TCC2_WO3                        (_UINT32_(1) << 4)

#define PIN_PD29F_TCC2_WO3                         _UINT32_(125)
#define MUX_PD29F_TCC2_WO3                         _UINT32_(5) 
#define PINMUX_PD29F_TCC2_WO3                      ((PIN_PD29F_TCC2_WO3 << 16) | MUX_PD29F_TCC2_WO3)
#define PORT_PD29F_TCC2_WO3                        (_UINT32_(1) << 29)

#define PIN_PA03F_TCC2_WO4                         _UINT32_(3) 
#define MUX_PA03F_TCC2_WO4                         _UINT32_(5) 
#define PINMUX_PA03F_TCC2_WO4                      ((PIN_PA03F_TCC2_WO4 << 16) | MUX_PA03F_TCC2_WO4)
#define PORT_PA03F_TCC2_WO4                        (_UINT32_(1) << 3)

#define PIN_PE04F_TCC2_WO4                         _UINT32_(132)
#define MUX_PE04F_TCC2_WO4                         _UINT32_(5) 
#define PINMUX_PE04F_TCC2_WO4                      ((PIN_PE04F_TCC2_WO4 << 16) | MUX_PE04F_TCC2_WO4)
#define PORT_PE04F_TCC2_WO4                        (_UINT32_(1) << 4)

#define PIN_PA02F_TCC2_WO5                         _UINT32_(2) 
#define MUX_PA02F_TCC2_WO5                         _UINT32_(5) 
#define PINMUX_PA02F_TCC2_WO5                      ((PIN_PA02F_TCC2_WO5 << 16) | MUX_PA02F_TCC2_WO5)
#define PORT_PA02F_TCC2_WO5                        (_UINT32_(1) << 2)

#define PIN_PE05F_TCC2_WO5                         _UINT32_(133)
#define MUX_PE05F_TCC2_WO5                         _UINT32_(5) 
#define PINMUX_PE05F_TCC2_WO5                      ((PIN_PE05F_TCC2_WO5 << 16) | MUX_PE05F_TCC2_WO5)
#define PORT_PE05F_TCC2_WO5                        (_UINT32_(1) << 5)

/* ========== PORT definition for TCC3 peripheral ========== */
#define PIN_PA05F_TCC3_WO0                         _UINT32_(5) 
#define MUX_PA05F_TCC3_WO0                         _UINT32_(5) 
#define PINMUX_PA05F_TCC3_WO0                      ((PIN_PA05F_TCC3_WO0 << 16) | MUX_PA05F_TCC3_WO0)
#define PORT_PA05F_TCC3_WO0                        (_UINT32_(1) << 5)

#define PIN_PA06F_TCC3_WO1                         _UINT32_(6) 
#define MUX_PA06F_TCC3_WO1                         _UINT32_(5) 
#define PINMUX_PA06F_TCC3_WO1                      ((PIN_PA06F_TCC3_WO1 << 16) | MUX_PA06F_TCC3_WO1)
#define PORT_PA06F_TCC3_WO1                        (_UINT32_(1) << 6)

/* ========== PORT definition for TCC4 peripheral ========== */
#define PIN_PC12F_TCC4_WO0                         _UINT32_(76)
#define MUX_PC12F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PC12F_TCC4_WO0                      ((PIN_PC12F_TCC4_WO0 << 16) | MUX_PC12F_TCC4_WO0)
#define PORT_PC12F_TCC4_WO0                        (_UINT32_(1) << 12)

#define PIN_PC29F_TCC4_WO0                         _UINT32_(93)
#define MUX_PC29F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PC29F_TCC4_WO0                      ((PIN_PC29F_TCC4_WO0 << 16) | MUX_PC29F_TCC4_WO0)
#define PORT_PC29F_TCC4_WO0                        (_UINT32_(1) << 29)

#define PIN_PC13F_TCC4_WO1                         _UINT32_(77)
#define MUX_PC13F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PC13F_TCC4_WO1                      ((PIN_PC13F_TCC4_WO1 << 16) | MUX_PC13F_TCC4_WO1)
#define PORT_PC13F_TCC4_WO1                        (_UINT32_(1) << 13)

#define PIN_PD13F_TCC4_WO1                         _UINT32_(109)
#define MUX_PD13F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PD13F_TCC4_WO1                      ((PIN_PD13F_TCC4_WO1 << 16) | MUX_PD13F_TCC4_WO1)
#define PORT_PD13F_TCC4_WO1                        (_UINT32_(1) << 13)

/* ========== PORT definition for TCC5 peripheral ========== */
#define PIN_PC08F_TCC5_WO0                         _UINT32_(72)
#define MUX_PC08F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PC08F_TCC5_WO0                      ((PIN_PC08F_TCC5_WO0 << 16) | MUX_PC08F_TCC5_WO0)
#define PORT_PC08F_TCC5_WO0                        (_UINT32_(1) << 8)

#define PIN_PC23F_TCC5_WO0                         _UINT32_(87)
#define MUX_PC23F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PC23F_TCC5_WO0                      ((PIN_PC23F_TCC5_WO0 << 16) | MUX_PC23F_TCC5_WO0)
#define PORT_PC23F_TCC5_WO0                        (_UINT32_(1) << 23)

#define PIN_PC09F_TCC5_WO1                         _UINT32_(73)
#define MUX_PC09F_TCC5_WO1                         _UINT32_(5) 
#define PINMUX_PC09F_TCC5_WO1                      ((PIN_PC09F_TCC5_WO1 << 16) | MUX_PC09F_TCC5_WO1)
#define PORT_PC09F_TCC5_WO1                        (_UINT32_(1) << 9)

#define PIN_PC24F_TCC5_WO1                         _UINT32_(88)
#define MUX_PC24F_TCC5_WO1                         _UINT32_(5) 
#define PINMUX_PC24F_TCC5_WO1                      ((PIN_PC24F_TCC5_WO1 << 16) | MUX_PC24F_TCC5_WO1)
#define PORT_PC24F_TCC5_WO1                        (_UINT32_(1) << 24)

/* ========== PORT definition for TCC6 peripheral ========== */
#define PIN_PC10F_TCC6_WO0                         _UINT32_(74)
#define MUX_PC10F_TCC6_WO0                         _UINT32_(5) 
#define PINMUX_PC10F_TCC6_WO0                      ((PIN_PC10F_TCC6_WO0 << 16) | MUX_PC10F_TCC6_WO0)
#define PORT_PC10F_TCC6_WO0                        (_UINT32_(1) << 10)

#define PIN_PC21F_TCC6_WO0                         _UINT32_(85)
#define MUX_PC21F_TCC6_WO0                         _UINT32_(5) 
#define PINMUX_PC21F_TCC6_WO0                      ((PIN_PC21F_TCC6_WO0 << 16) | MUX_PC21F_TCC6_WO0)
#define PORT_PC21F_TCC6_WO0                        (_UINT32_(1) << 21)

#define PIN_PC11F_TCC6_WO1                         _UINT32_(75)
#define MUX_PC11F_TCC6_WO1                         _UINT32_(5) 
#define PINMUX_PC11F_TCC6_WO1                      ((PIN_PC11F_TCC6_WO1 << 16) | MUX_PC11F_TCC6_WO1)
#define PORT_PC11F_TCC6_WO1                        (_UINT32_(1) << 11)

